Tekla Open API Reference for Tekla Structures 2025
TextFile Properties
The TextFile type exposes the following members.
Properties
Name | Description
Angle
 Gets or sets the angle (in degrees).
 (Inherited from EmbeddedObjectBase.)
Attributes
 Gets or sets the text file attributes.
FileName
 Gets or sets the file name defining the embedded object.
 (Inherited from EmbeddedObjectBase.)
InsertionPoint
 Gets or sets the insertion point.
 (Inherited from EmbeddedObjectBase.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Size
 Gets or sets the size of the frame of the embedded object.
 (Inherited from EmbeddedObjectBase.)
Top
See Also
Reference
TextFile Class
Tekla.Structures.Drawing Namespace